export enum Gender {
  Male = 'Male',
  Female = 'Female',
}

export enum DogBreed {
  오스트레일리언_캐틀독 = '오스트레일리언_캐틀_독',
  오스트레일리언_셰퍼드 = '오스트레일리언_셰퍼드',
  비어디드콜리 = '비어디드콜리',
  보더_콜리 = '보더_콜리',
  부비에_데_플랑드르 = '부비에_데_플랑드르',
  벨지안_셰퍼드_독 = '벨지안_셰퍼드_독',
  러프_콜리 = '러프_콜리',
  스무스_콜리 = '스무스_콜리',
  코몬도르 = '코몬도르',
  말티푸 = '말티푸',
  올드_잉글리쉬_쉽독 = '올드_잉글리쉬_쉽독',
  풀리 = '풀리',
  저먼_셰퍼드_독 = '저먼_셰퍼드_독',
  셰틀랜드_쉽독 = '셰틀랜드_쉽독',
  웰시_코기_카디건 = '웰시_코기(카디건)',
  웰시_코기 = '웰시_코기',
  체코슬로바키안_울프독 = '체코슬로바키안_울프독',
  아펜핀셔 = '아펜핀셔',
  불독 = '불독',
  불마스티프 = '불마스티프',
  버니즈_마운틴_독 = '버니즈_마운틴_독',
  복서 = '복서',
  도고_아르헨티노 = '도고_아르헨티노',
  도베르만 = '도베르만',
  프레사_까나리오 = '프레사_까나리오',
  그레이트_덴 = '그레이트_덴',
  피레니언_마운틴_독 = '피레니언_마운틴_독',
  자이언트_슈나우저 = '자이언트_슈나우저',
  레온베르거 = '레온베르거',
  마스티프 = '마스티프',
  미니어쳐_핀셔 = '미니어쳐_핀셔',
  미니어쳐_슈나우저 = '미니어쳐_슈나우저',
  뉴펀들랜드 = '뉴펀들랜드',
  네오폴리탄_마스티프 = '네오폴리탄_마스티프',
  로트바일러 = '로트바일러',
  세인트_버나드 = '세인트_버나드',
  슈나우저 = '슈나우저',
  도사 = '도사',
  티베탄_마스티프 = '티베탄_마스티프',
  케인_코르소_이탈리아노 = '케인_코르소_이탈리아노',
  샤페이 = '샤페이',
  센트럴_아시아_셰퍼드독 = '센트럴_아시아_셰퍼드독',
  코카시안_셰퍼드독 = '코카시안_셰퍼드독',
  필라_브라질레이로 = '필라_브라질레이로',
  아메리칸_스태포드셔_테리어 = '아메리칸_스태포드셔_테리어',
  에어데일_테리어 = '에어데일_테리어',
  베들링턴_테리어 = '베들링턴_테리어',
  불_테리어 = '불_테리어',
  케언_테리어 = '케언_테리어',
  댄디_딘몬트_테리어 = '댄디_딘몬트_테리어',
  저먼_헌팅_테리어 = '저먼_헌팅_테리어',
  아이리쉬소프트_코티드_휘튼_테리어 = '아이리쉬소프트_코티드_휘튼_테리어',
  잭_러셀_테리어 = '잭_러셀_테리어',
  케리_블루_테리어 = '케리_블루_테리어',
  레이크랜드_테리어 = '레이크랜드_테리어',
  미니어쳐_불_테리어 = '미니어쳐_불_테리어',
  맨체스터_테리어 = '맨체스터_테리어',
  노퍽_테리어 = '노퍽_테리어',
  노리치_테리어 = '노리치_테리어',
  파슨_러셀_테리어 = '파슨_러셀_테리어',
  스무스_폭스_테리어 = '스무스_폭스_테리어',
  실리햄_테리어 = '실리햄_테리어',
  스카이_테리어 = '스카이_테리어',
  스코티쉬_테리어 = '스코티쉬_테리어',
  와이어_폭스_테리어 = '와이어_폭스_테리어',
  웰시_테리어 = '웰시_테리어',
  웨스트_하일랜드_화이트_테리어 = '웨스트_하일랜드_화이트_테리어',
  요크셔_테리어 = '요크셔_테리어',
  닥스훈트 = '닥스훈트',
  호카이도 = '호카이도',
  알라스칸_말라뮤트 = '알라스칸_말라뮤트',
  바센지 = '바센지',
  차우차우 = '차우차우',
  아메리칸_아키타 = '아메리칸_아키타',
  시베리안_허스키 = '시베리안_허스키',
  진돗개 = '진돗개',
  아키타 = '아키타',
  키슈 = '키슈',
  시바 = '시바',
  시코쿠 = '시코쿠',
  저먼_스피츠 = '저먼_스피츠(키스혼드)',
  노르위전_엘크하운드_블랙 = '노르위전_엘크하운드(블랙)',
  노르위전_엘크하운드_그레이 = '노르위전_엘크하운드(그레이)',
  포메라니언 = '포메라니언',
  파라오_하운드 = '파라오_하운드',
  사모예드 = '사모예드',
  재패니즈_스피츠 = '재패니즈_스피츠',
  타이_리지백_독 = '타이_리지백_독',
  이스트_시베리안_라이카 = '이스트_시베리안_라이카',
  웨스트_시베리안_라이카 = '웨스트_시베리안_라이카',
  타이완_독 = '타이완_독',
  저먼_스피츠_미디엄 = '저먼_스피츠(미디엄_스피츠)',
  저먼_스피츠_미니어처 = '저먼_스피츠(미니어처_스피츠)',
  저먼_스피츠_자이언트 = '저먼_스피츠(자이언트_스피츠)',
  비글 = '비글',
  바셋_하운드 = '바셋_하운드',
  블랙_앤_탄_쿤_하운드 = '블랙_앤_탄_쿤_하운드',
  달마시안 = '달마시안',
  쁘띠_바셋_그리폰_벤딘 = '쁘띠_바셋_그리폰_벤딘',
  로디지안_리즈백 = '로디지안_리즈백',
  블러드하운드 = '블러드하운드',
  브리타니_스파니엘 = '브리타니_스파니엘',
  잉글리쉬_포인터 = '잉글리쉬_포인터',
  잉글리쉬_세터 = '잉글리쉬_세터',
  저먼_숏_헤어드_포인팅_독 = '저먼_숏_헤어드_포인팅_독',
  저먼_와이어_헤어드_포인팅_독 = '저먼_와이어_헤어드_포인팅_독',
  아이리쉬_레드_앤_화이트_세터 = '아이리쉬_레드_앤_화이트_세터',
  라지_먼스터랜더 = '라지_먼스터랜더',
  비즐라 = '비즐라',
  바이마라너 = '바이마라너',
  아이리쉬_레드_세터 = '아이리쉬_레드_세터',
  아메리칸_코커_스파니엘 = '아메리칸_코커_스파니엘',
  잉글리쉬_코커_스파니엘 = '잉글리쉬_코커_스파니엘',
  플랫_코티드_리트리버 = '플랫_코티드_리트리버',
  아이리쉬_워터_스파니엘 = '아이리쉬_워터_스파니엘',
  래브라도_리트리버 = '래브라도_리트리버',
  노바_스코샤_덕_톨링_리트리버 = '노바_스코샤_덕_톨링_리트리버',
  포르투기즈_워터_독 = '포르투기즈_워터_독',
  골든_리트리버 = '골든_리트리버',
  잉글리쉬_스프링거_스파니엘 = '잉글리쉬_스프링거_스파니엘',
  비숑_프리제 = '비숑_프리제',
  브뤼셀_그리폰 = '브뤼셀_그리폰',
  보스턴_테리어 = '보스턴_테리어',
  차이니즈_크레스티드_독 = '차이니즈_크레스티드_독',
  치와와 = '치와와',
  프렌치_불독 = '프렌치_불독',
  캐벌리어_킹_찰스_스파니엘 = '캐벌리어_킹_찰스_스파니엘',
  킹_찰스_스파니엘 = '킹_찰스_스파니엘',
  라사_압소 = '라사_압소',
  말티즈 = '말티즈',
  퍼그 = '퍼그',
  페키니즈 = '페키니즈',
  빠삐용 = '빠삐용',
  시츄 = '시츄',
  꼬똥_드_툴레아 = '꼬똥_드_툴레아',
  티베탄_테리어 = '티베탄_테리어',
  리틀_라이언_독 = '리틀_라이언_독',
  푸들 = '푸들',
  미디엄_푸들 = '미디엄_푸들',
  미니어쳐_푸들 = '미니어쳐_푸들',
  스탠다드_푸들 = '스탠다드_푸들',
  제패니즈_친 = '제패니즈_친',
  아프간_하운드 = '아프간_하운드',
  보르조이 = '보르조이',
  디어하운드 = '디어하운드',
  그레이하운드 = '그레이하운드',
  아이리쉬_울프하운드 = '아이리쉬_울프하운드',
  이탈리언_사이트하운드 = '이탈리언_사이트하운드(구:이탈리언_그레이하운드)',
  살루키 = '살루키',
  휘핏 = '휘핏',
  아자와크 = '아자와크',
  말티숑 = '말티숑',
  말티츄 = '말티츄',
  말티폼 = '말티폼',
}

export interface Pet {
  id: number;
  birthday: string;
  character: string | null;
  created_at: string;
  gender: Gender;
  image: string | null;
  is_newtralize: boolean;
  name: string;
  updated_at: string;
  user_id: string;
  weight: number;
  breed: DogBreed;
}

export interface PetFormType {
  birthday: string | undefined;
  character: string | undefined;
  gender: Gender | undefined;
  image: string | undefined;
  is_newtralize: boolean | undefined;
  name: string | undefined;
  weight: number | undefined;
  breed: DogBreed | undefined;
}

export interface CreatePetFormType extends PetFormType {
  user_id: string;
}

export interface UpdatePetFormType extends PetFormType {
  user_id: string;
  id: number;
}
